# What is pandas?

## Overview

### Objectives

+ Know why pandas is suitable for data analysis in Python
+ Identify a DataFrame as 

### Resources

+ [Official Documentation](http://pandas.pydata.org/pandas-docs/stable/)
+ [Package Overview](http://pandas.pydata.org/pandas-docs/stable/overview.html)
+ [Intro to Data Structures](http://pandas.pydata.org/pandas-docs/stable/dsintro.html)

## Welcome to ....
![][1]


### What is pandas?
pandas is one of the most popular open source data exploration libraries currently available. It gives its users the power to explore, manipulate, query, aggregate, and visualize **tabular** data. Tabular meaning data that is two-dimensional with rows and columns; i.e. a table.

### Why pandas ?
In this current age of data explosion, there are now many dozens of other tools that have many of the same capabilities as the pandas library. However, there are many aspects of pandas that make it an attractive choice for data analysis and it continues to have one of the fastest growing user bases.

* It's a Python library and integrates well with the other popular data science libraries such as numpy, scikit-learn, statsmodels, matplotlib and seaborn.
* It is nearly self-contained in that lots of functionality is built into one package. This contrasts with R, where many packages are needed to obtain the same functionality.
* The community is excellent. Looking at Stack Overflow, for example, there are [many ten's of thousands of][2] pandas questions. If you need help, you are nearly guaranteed to find it very quickly. 

### Why is it named after an East Asian bear?

The pandas library was begun by Wes McKinney beginning in 2008 at a hedge fund named AQR. Finance speak is to call tabular data 'panel data' which smashed together becomes pandas. If you are really interested in the history, you can hear it from the creator [himself][3].

### Python already has data structures to handle data, why do we need another one?

Even though Python is a high-level language, its primary built-in data structures lists and dictionaries, do not easily lend themselves to tabular data analysis in ways that humans can operate on them. 

### pandas is built directly on numpy

[numpy][4] ('numerical Python') is the most popular third-party Python library for scientific computing and forms the foundation for dozens of others, including pandas. numpy's primary data structure is an n-dimensional array which is much more powerful than a Python list and with much better performance.

All of the data in pandas is stored in numpy arrays. That said, it isn't necessary to know much about numpy when learning pandas. You can think of pandas as a higher-level, easier to use interface for doing data analysis than numpy. It is a good idea to eventually learn numpy, but for most tasks, pandas will be the right tool.


## pandas operates on tabular (table) data

There are numerous formats for data such as XML, JSON, raw bytes, and many others. But, for our purposes, we will only be examining what most people think of when they think of data - a table. pandas is built just for analyzing this tabular, rectangular, very deceptively normal concept of data. pandas has the capability to read in many different formats of data, but they all will be converted to tabular data.

### The DataFrame and Series

The DataFrame and Series are the two primary pandas objects that we will be using throughout this course.

* **DataFrame** - A two-dimensional data structure that looks like any other rectangular table of data you have seen with rows and columns.
* **Series** - A single dimension of data. It is analogous to a single column of data or a one dimensional array.

[1]: images/pandas_logo.png
[2]: http://stackoverflow.com/questions/tagged/pandas
[3]: https://www.youtube.com/watch?v=kHdkFyGCxiY
[4]: http://www.numpy.org/

## pandas examples

* Reading data
* Filtering data
* Aggregating methods
* Non-Aggregating methods
* Aggregating within groups
* Tidying data
* Joining data
* Time series analysis
* Visualization

### The `head` method

You will notice that many of the last lines of code end with the `head` method. This returns, by default, the first five rows. This helps keep the output compact.

In [2]:
import pandas as pd
import numpy as np

In [3]:
# Pandas series
df = pd.Series([10,12,13,14,15])
df

0    10
1    12
2    13
3    14
4    15
dtype: int64

In [4]:
# Pandas series
df = pd.Series([10,12,13,14,15],index = ['a','b','c','d','e'])
df

a    10
b    12
c    13
d    14
e    15
dtype: int64

In [5]:
dict1 = {'Model':['A','B','C','D','E'],'Price': [1000,2000,300,4000,500],'Items':[2,3,4,5,9]}
df = pd.DataFrame(dict1)
df

  Model  Price  Items
0     A   1000      2
1     B   2000      3
2     C    300      4
3     D   4000      5
4     E    500      9

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Model   5 non-null      object
 1   Price   5 non-null      int64
 2   Items   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [7]:
df['Total'] = df['Price']* df['Items']  # Create new col
df

  Model  Price  Items  Total
0     A   1000      2   2000
1     B   2000      3   6000
2     C    300      4   1200
3     D   4000      5  20000
4     E    500      9   4500

In [13]:
# drop cols
df.drop('Total',axis=1,inplace=True)
# df = df.drop('Total',axis=1)

KeyError: "['Total'] not found in axis"

In [14]:
df

  Model  Price  Items
0     A   1000      2
1     B   2000      3
2     C    300      4
3     D   4000      5
4     E    500      9

In [17]:
df.set_index('Model',inplace=True)

In [19]:
df['Total'] = df['Price']* df['Items']
df

       Price  Items  Total
Model
A       1000      2   2000
B       2000      3   6000
C        300      4   1200
D       4000      5  20000
E        500      9   4500

In [ ]:
#df.loc[rowlabel]
#df.iloc[index-num]

In [20]:
df.loc['A'] # rowlabel

Price    1000
Items       2
Total    2000
Name: A, dtype: int64

In [21]:
df.loc['A',['Items','Total']] # subset of row and cols -labels

Items       2
Total    2000
Name: A, dtype: int64

In [22]:
# C and D rows + Price and Total
df.loc[['C','D'],['Price','Total']]

       Price  Total
Model
C        300   1200
D       4000  20000

In [24]:
df.loc[:,['Price','Items']] # All rows and Cols-Price and Items

       Price  Items
Model
A       1000      2
B       2000      3
C        300      4
D       4000      5
E        500      9

In [25]:
df.iloc[[0,1]]  #index based rows A and B

       Price  Items  Total
Model
A       1000      2   2000
B       2000      3   6000

In [26]:
df.iloc[0:2]

       Price  Items  Total
Model
A       1000      2   2000
B       2000      3   6000

In [27]:
# extract all rows of column Price using iloc
df.iloc[:,[0]]

       Price
Model
A       1000
B       2000
C        300
D       4000
E        500

In [28]:
# Extract all rows and cols except last one using iloc
df.iloc[:-1]

       Price  Items  Total
Model
A       1000      2   2000
B       2000      3   6000
C        300      4   1200
D       4000      5  20000

## Components of a DataFrame - columns, index, and data
The DataFrame is composed of three separate components that you must know. The **columns**, the **index**, and the **data**. look at the following graphic of our `bikes` DataFrame stylized to put emphasis on each component.

![][1]

[1]: images/df_components.png

* The **index** provides a label for each row
* The **columns** provide a label for each column
* The **index** is also referred to as the **row names/labels**
* The **columns** are also referred to as the **column names/labels** or the **column index**
* An individual element of the index is referred to as an **index label/name** or **row label/name**
* An individual element of the columns is a **column name/label**
* The index and the columns are always in **bold font**
* Collectively the index and the columns are known as the **axes** (or individually as an **axis**)
* pandas uses integers to refer to each axis; 0 for the index and 1 for the columns. This is borrowed directly from numpy
* The actual **data** is always in normal font
* The **data** is also referred to as the **values**

In [ ]:
# Pandas Series

In [ ]:
# Creating dataframes

In [31]:
df1 = pd.DataFrame()
states = ['Kerala','karnataka','Gujarat','Andhra Pradesh','Assam']
df1['states'] = states
df1['pincode'] = [560040,534001,500010,781021,500010]
df1

           states  pincode
0          Kerala   560040
1       karnataka   534001
2         Gujarat   500010
3  Andhra Pradesh   781021
4           Assam   500010

In [33]:
df1.set_index('states',inplace=True)
df1

                pincode
states
Kerala           560040
karnataka        534001
Gujarat          500010
Andhra Pradesh   781021
Assam            500010

In [38]:
df1.reset_index(inplace=True)

In [39]:
df1

           states  pincode
0          Kerala   560040
1       karnataka   534001
2         Gujarat   500010
3  Andhra Pradesh   781021
4           Assam   500010

In [34]:
df1.to_csv("sample.csv")

In [35]:
import os
os.getcwd()

'D:\\DELOITTE\\DELOITTE_BATCH2\\Python\\batch-B'

In [41]:
list1 = [1,np.nan,3,4,10]
list2 = [np.nan,5,6,7,8]
dfnew = pd.DataFrame(zip(list1,list2),columns=['A','B'])
dfnew

      A    B
0   1.0  NaN
1   NaN  5.0
2   3.0  6.0
3   4.0  7.0
4  10.0  8.0

In [42]:
dfnew.isna()

       A      B
0  False   True
1   True  False
2  False  False
3  False  False
4  False  False

In [43]:
dfnew.isna().sum()

A    1
B    1
dtype: int64

In [46]:
df = pd.read_csv("occupation.csv",sep="|")

In [47]:
df.head()

   user_id  age gender  occupation zipcode
0        1   24      M  technician   85711
1        2   53      F       other   94043
2        3   23      M      writer   32067
3        4   24      M  technician   43537
4        5   33      F       other   15213

In [ ]:
# how to access specific columns from dataframe

In [48]:
df.head(10)

   user_id  age gender     occupation zipcode
0        1   24      M     technician   85711
1        2   53      F          other   94043
2        3   23      M         writer   32067
3        4   24      M     technician   43537
4        5   33      F          other   15213
5        6   42      M      executive   98101
6        7   57      M  administrator   91344
7        8   36      M  administrator   05201
8        9   29      M        student   01002
9       10   53      M         lawyer   90703

In [50]:
df.tail(10)

     user_id  age gender     occupation zipcode
933      934   61      M       engineer   22902
934      935   42      M         doctor   66221
935      936   24      M          other   32789
936      937   48      M       educator   98072
937      938   38      F     technician   55038
938      939   26      F        student   33319
939      940   32      M  administrator   02215
940      941   20      M        student   97229
941      942   48      F      librarian   78209
942      943   22      M        student   77841

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zipcode     943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [52]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zipcode'], dtype='object')

In [53]:
df['gender'].value_counts()

M    670
F    273
Name: gender, dtype: int64

In [54]:
df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zipcode       object
dtype: object

In [55]:
df.isnull().sum()

user_id       0
age           0
gender        0
occupation    0
zipcode       0
dtype: int64

In [ ]:
# How many different occupations are available in this dataset?

In [57]:
df['occupation'].nunique()

21

In [ ]:
# Find the count of users for each occupation.

In [58]:
df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [ ]:
# Which occupation that has most entries?

In [61]:
df['occupation'].value_counts().sort_values(ascending=False).head(1)

student    196
Name: occupation, dtype: int64

In [ ]:
# What is the average age of users?

In [64]:
int(df['age'].mean()) #integer

34

In [65]:
round(df['age'].mean(),2) #round off

34.05

In [ ]:
# What is the age with most occurence ?

In [67]:
df['age'].value_counts().sort_values(ascending=False).head(1) #max occurence

30    39
Name: age, dtype: int64

In [ ]:
# What is the minimum and maximum age of the user?

In [68]:
df['age'].min() #min age

7

In [69]:
df['age'].max() #max age

73

In [ ]:
# Display all records for users of age between 20 and 50

In [72]:
df[(df['age']>20) & (df['age']< 50)] # 709 records

     user_id  age gender     occupation zipcode
0          1   24      M     technician   85711
2          3   23      M         writer   32067
3          4   24      M     technician   43537
4          5   33      F          other   15213
5          6   42      M      executive   98101
..       ...  ...    ...            ...     ...
937      938   38      F     technician   55038
938      939   26      F        student   33319
939      940   32      M  administrator   02215
941      942   48      F      librarian   78209
942      943   22      M        student   77841

[709 rows x 5 columns]

In [75]:
df[(df['age']>20) & (df['age']< 50)].shape[0] #Number of records- age> 20 and age< 50

709

In [ ]:
# set the user_id as index column

In [80]:
df.set_index('user_id',inplace=True)

KeyError: "None of ['user_id'] are in the columns"

In [81]:
df.head()

         age gender  occupation zipcode
user_id
1         24      M  technician   85711
2         53      F       other   94043
3         23      M      writer   32067
4         24      M  technician   43537
5         33      F       other   15213

In [ ]:
#drop user_id column

In [84]:
df.reset_index(inplace=True)

In [90]:
df.drop(['index','user_id'],axis=1,inplace=True)

In [92]:
df.head()

   age gender  occupation zipcode
0   24      M  technician   85711
1   53      F       other   94043
2   23      M      writer   32067
3   24      M  technician   43537
4   33      F       other   15213

In [ ]:
# Display all the records from 4th row to the 8th row

In [ ]:
# How many users belong to the occupation writer ?

In [ ]:
# How many users donot belong to occupation writer ?

In [ ]:
# How many male and female users?

In [ ]:
# How to apply a function to a column and also how to create  a new column ?

In [ ]:
# Change M to value 1 and change F to value 0

In [ ]:
# Find the minimum and maximum age of the users for each occupation

In [ ]:
# For each combination of occupation and gender,calculate the mean age

# administrator: mean age of females and mean age of males

In [ ]:
# Convert all records in occupation column to uppercase

In [ ]:
# rename the columns age to current_age and occupation to current_occupation